In [107]:
import numpy as np
import pandas as pd

In [108]:
index_list  = []
length_list = []
label_list  = []

with open('./rod.dat', 'r') as file:
    
    lines = file.read().split('\n')
    
    for i in range(0, len(lines), 4):
        rod_index = int(lines[i])
#         rod_length = lines[i+1][6:]
        rod_length_list = lines[i+2][8:].split(', ')
        rod_label_list  = lines[i+3][7:].split(', ')
        
        rod_length_list = [float(v) for v in rod_length_list]
        rod_label_list  = [v for v in rod_label_list]

        for length, label in zip(rod_length_list, rod_label_list):
            index_list.append(rod_index)
            length_list.append(length)
            label_list.append(label)

In [109]:
df = pd.DataFrame({'rod_id': index_list, 'length': length_list, 'label': label_list})
df.set_index('label')
df.head()

   rod_id   length label
0       0  1189.13  0863
1       0   768.14  5863
2       1   970.29  1863
3       1   831.62  1363
4       1   195.61  2122

## Basic info

In [110]:
info = [
    '# of rods: %d' % len(df.rod_id.unique()),
    '# of cut rods: %d' % len(df.rod_id)
]

print('\n'.join(info))

# of rods: 25
# of cut rods: 186

## Total length of each rods

In [111]:
df.groupby('rod_id').sum()

         length
rod_id
0       1957.27
1       1997.52
2       1977.76
3       1998.84
4       1969.94
5       1997.38
6       1997.38
7       1997.46
8       1997.86
9       1922.49
10      1999.87
11      1999.61
12      1950.72
13      1999.73
14      1941.91
15      1999.39
16      1992.21
17      1939.74
18      1998.62
19      1922.30
20      1936.09
21      1933.95
22      1919.21
23      1980.84
24       323.42

## Queries

In [80]:
id = 0
df.query('id==%d' % index)

   id   length label
0   0  1185.13  0863
1   0   764.14  5863

In [81]:
label = '0863'
df.query('label=="%s"' % label)

   id   length label
0   0  1185.13  0863